src/main/resources/soap-requests/get-all-products.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://www.xp.com/soap/model">
   <soapenv:Header/>
   <soapenv:Body>
      <mod:GetAllProductsRequest/>
   </soapenv:Body>
</soapenv:Envelope>
